"detail.watchprovider.flatrate" = "Flatrate";
"detail.watchprovider.ads" = "Ads";
"detail.watchprovider.buy" = "Buy";

"sortingOrder.name" = "Name";
"sortingOrder.created" = "Created";
"sortingOrder.releaseDate" = "Release Date";
"sortingOrder.rating" = "Rating";

"sortingDirection.ascending" = "Ascending";
"sortingDirection.descending" = "Descending";

"library.list.movieSymbol" = "m.square";
"library.list.showSymbol" = "s.square";

"mediaInformation.rating" = "rating";
"mediaInformation.watched" = "watched";
"mediaInformation.watchAgain" = "watch again";
"mediaInformation.tags" = "tags";

"mediaSearch.noResults" = "No results";
"mediaSearch.loading" = "Loading...";
"mediaSearch.loadMore" = "Load more results...";
"mediaSearch.alert.error.title" = "Error Performing Search";
"mediaSearch.errorText" = "Error Loading Search Results";

"mediaStatus.planned" = "Planned";
"mediaStatus.inProduction" = "In Production";
"mediaStatus.cancelled" = "Cancelled";
"mediaStatus.returning" = "Returning";
"mediaStatus.pilot" = "Pilot";
"mediaStatus.ended" = "Ended";
"mediaStatus.rumored" = "Rumored";
"mediaStatus.postProduction" = "Post Production";
"mediaStatus.released" = "Released";

"detail.episodeAirDate %lld %lld %@" = "S%lldE%lld (%@)";
"detail.episodeAirDate %lld %lld" = "S%lldE%lld";

"detail.alert.newTag.title" = "New Tag";
"detail.alert.newTag.message" = "Enter a name for the new tag.";
"detail.alert.newTag.button.add" = "Add";

"detail.alert.tagAlreadyExists.title" = "Tag Already Exists";
"detail.alert.tagAlreadyExists.message" = "There is already a tag with that name.";

"showType.documentary" = "Documentary";
"showType.news" = "News";
"showType.miniseries" = "Miniseries";
"showType.reality" = "Reality";
"showType.scripted" = "Scripted";
"showType.talkShow" = "Talk Show";
"showType.video" = "Video";

"detail.alert.renameTag.title" = "Rename Tag";
"detail.alert.renameTag.message" = "Enter a new name for the tag.";
"detail.alert.renameTag.button.rename" = "Rename";

"settings.placeholder.loading" = "Loading...";

"settings.alert.importMedia.title" = "Import";
"settings.alert.importMedia.button.undo" = "Undo";

"settings.alert.importTags.title" = "Import";

"settings.alert.updateMediaComplete.title" = "Update Completed";

"settings.alert.resetLibrary.title" = "Reset Library";
"settings.alert.resetLibrary.message" = "This will delete all media objects in your library. Do you want to continue?";
"settings.alert.resetLibrary.button.delete" = "Delete";

"settings.alert.resetLibraryError.title" = "Error resetting library";

"settings.alert.resetTagsError.title" = "Error resetting tags";

"settings.alert.resetTags.title" = "Reset Tags";
"settings.alert.resetTags.message" = "This will delete all tags in your library. Do you want to continue?";
"settings.alert.resetTags.button.delete" = "Delete";

"generic.picker.value.yes" = "Yes";
"generic.picker.value.no" = "No";

"generic.alert.title.error" = "Error";
"generic.alert.button.okay" = "Ok";
"generic.alert.button.cancel" = "Cancel";
"generic.alert.button.yes" = "Yes";
"generic.alert.button.no" = "No";

"global.alert.errorLoadingCoreData.title" = "Error Loading Data";
"global.alert.errorSavingCoreData.title" = "Error Saving Data";

"languageChooser.alert.errorLoading.title" = "Error loading languages";
"languageChooser.loadingText" = "Loading Languages...";

"library.alert.errorUpdating.title" = "Error Updating";
"library.alert.errorUpdating.message %@ %@" = "Error Updating %@: %@";

"addMedia.alert.alreadyAdded.title" = "Already Added";
"addMedia.alert.alreadyAdded.message %@" = "You already have '%@' in your library.";

"addMedia.alert.errorLoading.title" = "Error Loading Media";
"addMedia.navBar.title" = "Add Media";
"addMedia.navBar.button.close" = "Close";

"lookup.alert.errorLoading.title" = "Error Loading Media";

"detail.tags.header" = "Select all tags that apply";

"settings.alert.reloadCompleted.title" = "Reload Completed";
"settings.alert.reloadCompleted.message" = "All media objects have been reloaded.";

"settings.alert.errorReloadingLibrary.title" = "Error Reloading Library";

"settings.alert.reloadLibrary.title" = "Reload library?";
"settings.alert.reloadLibrary.message" = "Do you want to reload all media objects using the new language/region settings?";

"settings.languagePicker.loadingText" = "Loading...";
"settings.languagePicker.alert.errorLoading.title" = "Error Updating Languages";

"settings.alert.errorBuyingPro.title" = "Unable to Purchase";
"settings.alert.errorBuyingPro.message" = "The requested In-App Purchase was not found.";

"settings.alert.tagImportError.title" = "Error Importing Tags";

"settings.alert.genericImportError.title" = "Import Error";
"settings.alert.genericExportError.title" = "Export Error";
"settings.alert.genericExportError.message" = "There was an error creating the export file.";

"settings.alert.libraryUpdateError.title" = "Update Error";

"tabView.library.label" = "Library";
"tabView.lookup.label" = "Lookup";
"tabView.problems.label" = "Problems";
"tabView.settings.label" = "Settings";

"generic.errorText" = "Error";

"problems.noProblemsText" = "There are no problems in your library.";

"problemType.duplicateMedia.description" = "Duplicate Media Objects";
"problemType.duplicateMedia.recovery" = "Delete one of the following medias";

"global.strings.movie" = "Movie";
"global.strings.show" = "TV Show";

"library.filter.button.reset" = "Reset";
"library.filter.button.apply" = "Apply";

"library.filter.userData.label.watched" = "Watched?";
"library.filter.information.label.personalRating" = "Personal Rating";
"library.filter.information.label.year" = "Year";

"library.filter.value.any" = "Any";

"detail.userData.header" = "User Data";
"detail.information.header" = "Information";

"detail.userData.header" = "User Data";
"detail.basicInfo.header" = "Basic Information";
"detail.extendedInfo.header" = "Extended Information";
"detail.metadata.header" = "Metadata";

"library.filter.showSpecific.header" = "Show Specific";
"library.filter.showSpecific.label.seasons" = "Seasons";

"problems.list.missingList %@" = "Missing: %@";
"detail.errorLoadingText" = "Error loading media";
"detail.basicInfo.runtime.minutesAndHours %@ %@" = "%@ (%@)";

"detail.basicInfo.cast" = "Cast";

"detail.watchProviders.label" = "Watch Providers";
"detail.watchProviders.attribution" = "Powered by [JustWatch.com](https://www.justwatch.com)";

"detail.userData.watchedShow.label.no" = "No";
"detail.userData.watchedShow.label.season %lld" = "Season %lld";
"detail.userData.watchedShow.label.seasonAndEpisode %lld %lld" = "Season %lld, Episode %lld";
"detail.userData.watchedShow.header" = "Up to which Episode did you watch?";
"detail.userData.watchedShow.label.seasonNumber %lld" = "Season %lld";
"detail.userData.watchedShow.label.notWatched" = "Not Watched";
"detail.userData.watchedShow.label.allEpisodes" = "All Episodes";
"detail.userData.watchedShow.label.episodeNumber %lld" = "Episode %lld";

"detail.userData.noNotes" = "No Notes";
"detail.userData.tags.none" = "None";

"proInfo.aboutMe.header" = "About me";
"proInfo.aboutMe.text" = "Hi, my name is Jonas and I'm a student at the Karlsruher Institute of Technology in Karlsruhe, Germany. In my free time I make apps for fun and this app is one of those. It started as a personal project of mine in an endeavour to catalog all the movies and tv shows I ever watched, so I would be able to recommend good movies or shows to friends. The app has grown big enough and works good enough that I thought I would publish it on the App Store, so here we are.";
"proInfo.buyButton.label.disabled" = "Already Purchased";
"proInfo.buyButton.label %@" = "Buy Pro - %@";
"settings.footer.version %@" = "Version %@";
"legal.appIconAttribution %@" = "App Icon: %@";
"legal.legalNotice %@" = "All content and images are properties of their respective owners.\nFor legal concerns, contact %@.";
"generic.picker.noValues" = "No entries";
"generic.picker.navBar.button.reset" = "Reset";
"generic.picker.range.from" = "From";
"generic.picker.range.to" = "To";
"generic.picker.range.from.value %@" = "From %@";
"generic.picker.range.to.value %@" = "To %@";
"problems.navBar.title" = "Problems";
"library.filter.navBar.title" = "Filter Options";
"generic.navBar.loadingTitle" = "Loading";
"detail.seasonsInfo.navBar.title" = "Seasons";
"detail.notes.navBar.title" = "Notes";
"detail.tags.navBar.title" = "Tags";
"languageChooser.navBar.title" = "Select Language";
"resolveProblems.navBar.title" = "Problems";
"library.filter.watched.navBar.title" = "Watched?";
"library.filter.watchAgain.navBar.title" = "Watch Again?";
"library.filter.mediaType.navBar.title" = "Media Type";
"detail.navBar.errorTitle" = "Error";
"proInfo.navBar.title" = "Movie DB Pro";
"settings.importLog.navBar.title" = "Import Log";
"legal.navBar.title" = "Legal";
"library.filter.information.label.genres" = "Genres";
"library.filter.userData.label.tags" = "Tags";
"library.filter.information.label.mediaType" = "Media Type";
"library.filter.userData.label.watchAgain" = "Watch again?";
"library.filter.showSpecific.label.showType" = "Show Type";
"library.filter.information.label.status" = "Status";
"settings.progressText.updatingMediaObjects" = "Updating media objects...";
"settings.progressText.resetLibrary" = "Resetting Library...";
"settings.progressText.resetTags" = "Resetting Tags...";
"settings.navBar.button.legal" = "Legal";
"library.navBar.button.filter" = "Filter";
"library.list.swipe.delete" = "Delete";
"library.list.swipe.reload" = "Reload";
"proInfo.button.restore" = "Restore";
"proInfo.navBar.button.cancel" = "Cancel";

"settings.actions.buyPro.label" = "Buy Pro";
"settings.actions.importMedia.label" = "Import Media";
"settings.actions.exportMedia.label" = "Export Media";
"settings.actions.importTags.label" = "Import Tags";
"settings.actions.exportTags.label" = "Export Tags";

"settings.importLog.navBar.button.close" = "Close";
"settings.importLog.navBar.button.copy" = "Copy";

"settings.actions.reloadMedia.label" = "Reload Media";
"settings.actions.updateMedia.label" = "Update Media";
"settings.actions.resetLibrary.label" = "Reset Library";
"settings.actions.resetTags.label" = "Reset Tags";
"library.navBar.header.sorting" = "Sorting";
"settings.language.navBar.title" = "Language";
"settings.region.navBar.title" = "Region";

"detail.userData.headline.personalRating" = "Personal Rating";
"detail.userData.headline.watched" = "Watched?";
"detail.userData.headline.watchAgain" = "Watch again?";
"detail.userData.headline.tags" = "Tags";
"detail.userData.headline.notes" = "Notes";

"detail.basicInfo.headline.genres" = "Genres";
"detail.basicInfo.headline.description" = "Description";
"detail.basicInfo.headline.releaseDate" = "Release Date";
"detail.basicInfo.headline.runtime" = "Runtime";
"detail.basicInfo.headline.firstAired" = "First Aired";
"detail.basicInfo.headline.lastEpisode" = "Last Episode";
"detail.basicInfo.headline.lastAired" = "Last Aired";
"detail.basicInfo.headline.nextEpisode" = "Next Episode";
"detail.basicInfo.headline.showType" = "Show Type";
"detail.basicInfo.headline.status" = "Status";
"detail.basicInfo.headline.originalTitle" = "Original Title";
"detail.basicInfo.headline.originalLanguage" = "Original Language";
"detail.basicInfo.headline.seasons" = "Seasons";

"detail.extendedInfo.headline.tagline" = "Tagline";
"detail.extendedInfo.headline.budget" = "Budget";
"detail.extendedInfo.headline.revenue" = "Revenue";
"detail.extendedInfo.headline.tmdbID" = "TMDb ID";
"detail.extendedInfo.headline.imdbID" = "IMDB ID";
"detail.extendedInfo.headline.homepage" = "Homepage";
"detail.extendedInfo.headline.productionCompanies" = "Production Companies";
"detail.extendedInfo.headline.networks" = "Networks";
"detail.extendedInfo.headline.createdBy" = "Created by";
"detail.extendedInfo.headline.popularity" = "Popularity";
"detail.extendedInfo.headline.scoring" = "Scoring";

"detail.metadata.headline.internalID" = "Internal ID";
"detail.metadata.headline.created" = "Created";
"detail.metadata.headline.lastModified" = "Last Modified";

"apiError.invalidResponse.description" = "The request returned invalid data.";
"apiError.unauthorized.description" = "API call unauthorized. Invalid API key.";
"apiError.invalidPageRange.description" = "Invalid range of pages. Please specify a valid range.";
"apiError.pageOutOfBounds.description" = "Requested page is out of bounds";
"apiError.unknown.description %lld %@" = "HTTP Error %lld: %@";
"apiError.updateError.description" = "Error updating the media.";
"apiError.statusNotOk.description %lld" = "Error executing request. HTTP Reponse code %lld.";

"settings.progressText.reloadLibrary" = "Reloading media objects...";
"settings.toggle.showAdultContent.label" = "Show Adult Content";

"detail.userData.watched.picker.watched" = "Yes";
"detail.userData.watched.picker.partiallyWatched" = "Partially";
"detail.userData.watched.picker.notWatched" = "No";

"library.filter.information.label.year %lld" = "%lld";
"library.filter.information.label.year.range %lld %lld" = "%lld to %lld";

"detail.basicInfo.headline.productionCountries" = "Production Countries";
"generic.unknown" = "Unknown";
"generic.loadingText" = "Loading...";
"detail.alert.errorLoadingCastTitle" = "Error Loading Cast";
"settings.feedback.label" = "Feedback";
